app/Services/AuthService.php

update `users` set `password` = '$2y$10$8YqDdtbwpqEmJnIsIpbCuuDP8zIVa.iEZ9Cnmh4WbwMcosZfcH3mq', `users`.`updated_at` = '2024-12-17 05:46:27' where `id` = 25
---
	public function loginUserByObject($user)
	{
		try {
			Auth::login($user);

			/**
			 * Create new random password for the user to be used for logging out of other devices.
			 */
			$password = (new MiscService)->generateAlphaNumericCode(15);
	        $user->password = Hash::make($password);
	        $user->save();