app/Listeners/IncreaseViews.php

    public function handle(ThreadViewed $event)
    {
        $event->thread->increment('views');
---
update `threads` set `views` = `views` + 1, `threads`.`updated_at` = '2024-12-17 07:41:41' where `id` = 8