app/Http/Controllers/Frontend/FrontendController.php

    public function home(Request $request)
    {
        $banners = Banner::all();
        $aboutUs = Page::where('slug', 'about-us')->first();
---
select * from `banners`
select * from `pages` where `slug` = 'about-us' limit 1