app/Http/Controllers/Frontend/TakeTestsController.php

    public function create(Course $course)
    {
        $course_test = CourseTest::where('course_id',$course->id)->first();
        // dd($course);
        if(!empty($course_test)){
            $course_test_chapters = CourseTestChapter::where('course_test_id',$course_test->id)->where('number_of_questions', '!=', 0)->get()->toArray();
            // dd($course_test_chapters);
            if(!empty($course_test_chapters)){
                $questions = $course_chapter_ids = $difficulty_level_ids = array();
                $number_of_questions_total = 0;
                // $questions = new Collection();
                $all_questions = array();
                foreach($course_test_chapters as $ch){
                    $course_chapter_ids[] = $ch['course_chapter_id'];
                    $difficulty_level_ids[] = $ch['difficulty_level_id'];
                    $number_of_questions_total += $ch['number_of_questions'];
                    $questions = Question::where('course_chapter_id', $ch['course_chapter_id'])->where('difficulty_level_id',$ch['difficulty_level_id'])->limit($ch['number_of_questions'])->inRandomOrder()->get()->toArray();

                    $all_questions =  array_merge($all_questions,$questions);
                }
                // echo '<pre>'; print_r($all_questions); die;
                $takeTestData = array(
                    'user_id' => \Auth::user()->id,
                    'course_id' => $course->id,
                    'created_at' => date('Y-m-d H:i:s')
                );
                /* Create take test */
                $take_test_id =  TakeTest::insertGetId($takeTestData);
---
select * from `course_tests` where `course_id` = 9 limit 1
select * from `course_test_chapters` where `course_test_id` = 3 and `number_of_questions` != 0
select * from `questions` where `course_chapter_id` = 41 and `difficulty_level_id` = 1 order by RAND() limit 5
insert into `take_tests` (`user_id`, `course_id`, `created_at`) values (25, 9, '2024-12-17 07:32:19')

                        'status' => 0,
                        'created_at' => date('Y-m-d H:i:s')
                    );
                    TakeTestQuestion::insert($testQuestionData);
---
insert into `take_test_questions` (`take_test_id`, `question_id`, `status`, `created_at`) values (4, 519, 0, '2024-12-17 07:32:19')

    public function finish(Course $course, $encryptedTakeTestId)
    {
        try {
            $take_test_id = \Crypt::decrypt($encryptedTakeTestId);
            TakeTest::where('id', $take_test_id)->update([
                'is_submitted' => 1
            ]);
---
update `take_tests` set `is_submitted` = 1, `take_tests`.`updated_at` = '2024-12-17 07:32:56' where `id` = 4

    public function result(Course $course, $encryptedTakeTestId)
    {
        try {
            $take_test_id = \Crypt::decrypt($encryptedTakeTestId);
            $take_test = TakeTest::find($take_test_id);
            $take_test_questions = TakeTestQuestion::where('take_test_id', $take_test_id)->get();

            $number_of_questions_correct = TakeTestQuestion::where('take_test_id', $take_test_id)->where('is_correct', 1)->count();
            $number_of_questions_incorrect = TakeTestQuestion::where('take_test_id', $take_test_id)->where('is_correct', 0)->count();
            $number_of_questions_not_attempted = TakeTestQuestion::where('take_test_id', $take_test_id)->where('status', 0)->count();
            $total_time_taken = TakeTestQuestion::where('take_test_id', $take_test_id)->sum('time_taken');

            $all_incorrect_questions = TakeTestQuestion::where('take_test_id', $take_test_id)->where('is_correct', 0)->get();
---
select * from `take_tests` where `take_tests`.`id` = 1 limit 1
select * from `take_test_questions` where `take_test_id` = 1
select count(*) as aggregate from `take_test_questions` where `take_test_id` = 1 and `is_correct` = 1
select count(*) as aggregate from `take_test_questions` where `take_test_id` = 1 and `status` = 0
select sum(`time_taken`) as aggregate from `take_test_questions` where `take_test_id` = 1
select * from `take_test_questions` where `take_test_id` = 1 and `is_correct` = 0