app/Http/Controllers/APIController.php

    public function get_take_test_qn_by_id(Request $request)
    {
        $take_test_id = $request->take_test_id;
        $id = $request->id;



        $data = TakeTestQuestion::with(array(
            "question" => function($query) {
                $query->with("options");
            }
        ))->find($id);

        if($data->status == 0){
            TakeTestQuestion::where('id', $id)->update(['status'=>1]);
---
select * from `questions` where `questions`.`id` in (519)
select * from `take_test_questions` where `take_test_questions`.`id` = '46' limit 1
update `take_test_questions` set `status` = 1, `take_test_questions`.`updated_at` = '2024-12-17 07:32:22' where `id` = '46'

    public function save_answer_take_test_by_id(Request $request)
    {
        $take_test_question_id = $request->take_test_question_id;
        $id = $request->id; // option id

        $question_options = QuestionOption::find($id);
        $is_correct = $question_options->is_correct;

        $take_test_qn = TakeTestQuestion::find($take_test_question_id);
        $question_visited_time = $take_test_qn->updated_at;
        $now = date('Y-m-d H:i:s');
        $timeFirst  = strtotime($question_visited_time);
        $timeSecond = strtotime($now);
        $time_taken = ($timeSecond - $timeFirst);

        TakeTestQuestion::where('id', $take_test_question_id)->update([
            'question_option_id' => $id,
            'is_correct' => $is_correct,
            'status' => 2,
            'time_taken' => $time_taken
        ]);
---
select * from `question_options` where `question_options`.`id` = '2073' limit 1
select * from `take_test_questions` where `take_test_questions`.`id` = '46' limit 1
update `take_test_questions` set `question_option_id` = '2073', `is_correct` = 0, `status` = 2, `time_taken` = 6, `take_test_questions`.`updated_at` = '2024-12-17 07:32:28' where `id` = '46'