app/Models/User.php

    public function getFirstUserCourseByCourseId($courseId)
    {
        /**
         * Check if the course is already bought by user or not.
         * IF it is bought.
         * THEN check the end_on.
         * ELSE return false.
         */
        if ($userCourse = $this->courses()->whereCourseId($courseId)->first()) {
---
select * from `user_courses` where `user_courses`.`user_id` = 25 and `user_courses`.`user_id` is not null and `course_id` = 9 limit 1