app/Providers/AppServiceProvider.php

select * from `channels`
select * from `channels` order by RAND() limit 10
select * from `threads` where `user_id` = 25 order by RAND() limit 5
---
    public function boot()
    {
        Tax::observe(TaxObserver::class);
        Topic::observe(TopicObserver::class);
        Course::observe(CourseObserver::class);
        CourseChapter::observe(CourseChapterObserver::class);
        CourseChapterContent::observe(CourseChapterContentObserver::class);
        Thread::observe(ThreadObserver::class);
        Reply::observe(ReplyObserver::class);
        Favourite::observe(FavouriteObserver::class);
        Channel::observe(ChannelObserver::class);

        \View::composer('*', function ($view) {
            $channels = Channel::all();
            $channelsToFollow = Channel::inRandomOrder()->take(10)->get();

            $view->with('channels', $channels);
            $view->with('channelsToFollow', $channelsToFollow);

            if (Auth::check()) {
                $myActiveThreads = Thread::whereUserId(Auth::id())->inRandomOrder()->take(5)->get();