app/Http/Controllers/Backend/ThreadsController.php

    public function index(Channel $channel, ThreadFilters $filters)
    {
        if (request()->has('subscribed') && auth()->check()) {
            if ($channel->exists) {
                $threads = request()->user()->subscribedThreads()->where('channel_id', $channel->id)->paginate(20);
            } else {
                $threads = request()->user()->subscribedThreads()->paginate(20);
            }
        } else {
            $threads = $this->getThreads($channel, $filters);
        }

        if (request()->wantsJson()) {
            return $threads;
        };

        $banners = Banner::all();
---
select * from `banners`

    public function show($channelId, Thread $thread)
    {
        /**
         * Call the thread viewed event
         */
        event(new ThreadViewed($thread));

        return view('backend.student.threads.show', [
            'thread' => $thread,
            'channelId' => $channelId,
            'replies' => $thread->replies()->paginate(10)
---
select * from `replies` where `replies`.`thread_id` = 8 and `replies`.`thread_id` is not null limit 10 offset 0
select count(*) as aggregate from `replies` where `replies`.`thread_id` = 8 and `replies`.`thread_id` is not null

    public function getThreads(Channel $channel, ThreadFilters $filters)
    {
        $threads = Thread::latest()->filter($filters);

        if ($channel->exists) {
            $threads->where('channel_id', $channel->id);
        }
        return $threads->paginate(20);
---
select * from `threads` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `threads`