app/Http/Controllers/Backend/UsersController.php

    public function userDetailsDownloadCsv(Request $request)
    {
        # code...
        $id = !empty($request->id)?$request->id:25;
        $user = User::find($id);
---
select * from `users` where `users`.`id` = '25' limit 1