app/Repositories/FooterRepository.php

select * from `footers` limit 1
---
	public function getFirstFooter()
	{
		try {
			return Footer::first();