app/Repositories/MenuItemRepository.php

select * from `menu_items` where `parent_id` is null order by `sort_order` asc
---
	public function getAllMenuItemsWithoutParent()
	{
		try {
			return MenuItem::whereNull('parent_id')
							 ->orderBy('sort_order')
							 ->get();