app/Repositories/ThreadRepository.php

select * from `threads` order by `updated_at` desc limit 6
---
	public function getLatestUpdatedThreads($numberOfThreads)
	{
		try {
			return Thread::orderBy('updated_at', 'desc')->take($numberOfThreads)->get();