app/Repositories/UserOtpRepository.php

    public function updateUserOtpByObject($update, $userOtp)
    {
        try {
            return $userOtp->update($update);
---
update `user_otps` set `otp` = 7796, `user_otps`.`updated_at` = '2024-12-18 07:07:04' where `id` = 24