app/Repositories/UserRepository.php

	public function getFirstUserByPhoneNumber($phoneNumber)
	{
		try {
			return User::wherePhoneNumber($phoneNumber)->first();
---
select * from `users` where `phone_number` = '8420425082' limit 1

    public function updateUserByObject($update, $user)
    {
        try {
            return $user->update($update);
---
update `users` set `other_details` = '{\"dob\":\"1993-01-01\",\"gender\":\"Male\",\"designation\":\"Trainee pilot\",\"address\":\"Barrackpore\",\"goal\":\"Need to learn all about aviation\",\"newsletter\":\"1\"}', `users`.`updated_at` = '2024-12-17 05:47:47' where `id` = 25

	public function getPaginatedListOfUsers($perPage)
	{
		try {
			return User::paginate($perPage);
---
select * from `users` limit 20 offset 20
select count(*) as aggregate from `users`