app/Repositories/UserActionRepository.php

    public function createUserAction($user, $input)
    {
        try {
        	$newUserAction = new UserAction($input);

            return $user->actions()->save($newUserAction);
---
insert into `user_actions` (`session_id`, `action`, `actionable_id`, `actionable_type`, `remarks`, `userable_id`, `userable_type`, `updated_at`, `created_at`) values ('Eu2CJng4PFC9LqaiAYCw1ZQCmabWJHlYphzeTZMz', 'logged-in', '', '', '{\"ip_address\":\"127.0.0.1\",\"user_agent\":\"Mozilla\/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit\/537.36 (KHTML, like Gecko) Chrome\/131.0.0.0 Safari\/537.36\"}', 1, 'App\Models\User', '2024-12-17 05:45:57', '2024-12-17 05:45:57')